Revit 2026 API

# LightTypeSetInitialColor Method

---

Replace the current initial color object with the given object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetInitialColor(
	InitialColor initialColor
)
```
```vb
Public Sub SetInitialColor (
	initialColor As InitialColor
)
```
```cpp
public:
void SetInitialColor(
	InitialColor^ initialColor
)
```
```fsharp
member SetInitialColor :
        initialColor : InitialColor -> unit
```

#### Parameters

initialColor InitialColor
     An object derived from an InitialColor object The object pointed to is cloned internally

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The argument object is cloned

#### Reference

LightType Class

Autodesk.Revit.DB.Lighting Namespace